import json

people = {
    "Бондаренко": ["Максим", "Олегович", 1993],
    "Мельник": ["Світлана", "Андріївна", 1987],
    "Романюк": ["Віктор", "Іванович", 1979],
    "Савчук": ["Юлія", "Володимирівна", 2001],
    "Дорошенко": ["Олександр", "Сергійович", 1990],
    "Поліщук": ["Наталя", "Михайлівна", 1984],
    "Климчук": ["Денис", "Павлович", 1996],
    "Захарченко": ["Ольга", "Романівна", 1999],
    "Мороз": ["Артем", "Євгенович", 1982],
    "Черненко": ["Людмила", "Богданівна", 1974]
}

def write_json(filename="people.json"):
    with open(filename, "w", encoding="utf-8") as f:
        json.dump(people, f, ensure_ascii=False, indent=2)
    print(f"Записано {len(people)} записів у файл '{filename}'.")

if __name__ == "__main__":
    write_json()